// Файл first.fx
//-----------------------------------------------------------------------
// Структуры данных
//-----------------------------------------------------------------------
struct VS_INPUT
{
    float4 Pos : POSITION;
};

struct PS_INPUT
{
    float4 Pos : SV_POSITION;
};
//-----------------------------------------------------------------------
// Функция вершинного шейдера
//-----------------------------------------------------------------------
PS_INPUT VS( VS_INPUT Data )
{
    PS_INPUT Out;
    Out.Pos = Data.Pos;
    return Out;
}
//-----------------------------------------------------------------------
// Функция пиксельного шейдера
//-----------------------------------------------------------------------
float4 PS( PS_INPUT Pos ) : SV_Target
{
    return float4( 1.0f, 1.0f, 1.0f, 1.0f );// Белый цвет
}
//-----------------------------------------------------------------------
// Техника отображения
//-----------------------------------------------------------------------
technique10 RenderWhite
{
    pass P0
    {
        SetVertexShader( CompileShader( vs_4_0, VS() ) );
        SetGeometryShader( NULL );
        SetPixelShader( CompileShader( ps_4_0, PS() ) );
    }
}
