// Анимация треугольника
// Файл rotate.fx
//-----------------------------------------------------------------------
// Структуры данных
//-----------------------------------------------------------------------
struct VS_INPUT
{
    float4 Pos : POSITION;
};

struct PS_INPUT
{
    float4 Pos : SV_POSITION;
};

//-----------------------------------------------------------------------
// Глобальные переменные
//-----------------------------------------------------------------------
matrix World;
matrix View;
matrix Projection;

//-----------------------------------------------------------------------
// Функция вершинного шейдера
//-----------------------------------------------------------------------
PS_INPUT VS( VS_INPUT Data )
{
    PS_INPUT Out;
    Out = (PS_INPUT)0;
    
    // Умножаем координаты вершины
    // на матрицы преобразований
    Out.Pos = mul (Data.Pos, World);
    Out.Pos = mul (Out.Pos, View);
    Out.Pos = mul (Out.Pos, Projection);

    return Out;
}
//-----------------------------------------------------------------------
// Функция пиксельного шейдера
//-----------------------------------------------------------------------
float4 PS( PS_INPUT Pos ) : SV_Target
{
    return float4( 1.0f, 1.0f, 1.0f, 1.0f );// Белый цвет
}
//-----------------------------------------------------------------------
// Техника отображения
//-----------------------------------------------------------------------
        // Создаем набор настроек растеризатора
        // без отсечения невидимых граней
        RasterizerState rsNoCulling { CullMode = None; };
technique10 RenderWhite
{
    pass P0
    {
        SetVertexShader( CompileShader( vs_4_0, VS() ) );
        SetGeometryShader( NULL );
        SetPixelShader( CompileShader( ps_4_0, PS() ) );
        // Невидимые грани не отсекать
        SetRasterizerState( rsNoCulling);
    }
}
